package Lesson7

//Задания для Цикла for
//Прямой Диапазон:
//
//Напишите цикл for, который выводит числа от 1 до 5.
//Напишите цикл for, который выводит четные числа от 1 до 10.
//Обратный Диапазон:
//
//Создайте цикл for, который выводит числа от 5 до 1.
//Создайте цикл for, который выводит числа от 10 до 1, уменьшая их на 2.
//С Шагом (step):
//
//Используйте цикл for с шагом 2 для вывода чисел от 1 до 9.
//Напишите цикл for, который выводит каждое третье число в диапазоне от 1 до 20.
//Использование До (until):
//
//Используйте цикл for и until, чтобы вывести числа из диапазона 1-9 (9 не включается).
//Напишите цикл for с until, чтобы вывести числа от 3 до 15, не включая 15.
//Задания для Цикла while
//Цикл while:
//
//Создайте цикл while, который выводит квадраты чисел от 1 до 5.
//Напишите цикл while, который уменьшает число от 10 до 5. После этого вывести результат в консоль
//Цикл do...while:
//
//Используйте цикл do...while, чтобы вывести числа от 5 до 1.
//Создайте цикл do...while, который повторяется, пока счетчик меньше 10, начиная с 5.
//Задания для Прерывания и Пропуска Итерации
//Использование break:
//
//Напишите цикл for от 1 до 10 и используйте break, чтобы выйти из цикла при достижении 6.
//
//Создайте цикл while, который бесконечно выводит числа, начиная с 1, но прерывается при достижении 10.
//Использование continue:
//
//В цикле for от 1 до 10 используйте continue, чтобы пропустить четные числа.
////Напишите цикл while, который выводит числа от 1 до 10, но пропускает числа, кратные 3.
////Задача на вложенный цикл
////
fun main () {

//    for (j in 1..5) {
//        println(j)
//    }
//    for (i in 0..10 step 2) {
//        println(i)
//    }
//
//    for (k in 1..10) {
//        if (k % 2 == 0)
//            println(k)
//    }
//
//    for (m in 5 downTo 1) {
//        println(m)
//    }
//
//
//  for (a in 10 downTo 1 step 2) {
//    println(a)
// }
//    for(t in 1..9 step 2){
//        println(t)
//    }
// for (b in 1 until 20 step 3 ){
//     println(b)
// }
//    for (c in 1 until 9){
//        println(c)}
//    for (h in 1..9) {
//        if (h != 9) {
//            println(h)
//        }
//
//    }
//    for (n in 3 until 15){
//        println(n)}
//   var f = 1
    //

//   while  ( f <=5  ){
//    println(f * f++)
//        }

//    var e= 10
//    while (e >5){
//        e--
//        println(e)
//
//    }

//var y =5
//    do {
//        println(y)
//        y--
//    } while (y>=1)
//    var s =5
//    do {
//        println(s)
//        s++
//    } while (s<=10)
//for (i in 1..10){
//    if(i==6) break
//    println(i)
//}
//    for (o in 1 ..10){
//      if(o % 2 ==0) continue
//        println(o)
//    }
//var v =1
//while (v <=10){
//    if(v % 3==0)
//        println(v)
//    v++
//}
    for (w in 1..10){
//
       for (u in 1..10) {

           println(w*u)
           println("")


          }




    }}






// //Создать цикл в цикле, в каждом использовать диапазон от 0 до 10. В консоль вывести результат умножения переменных цикла.
// Результат умножения выводить через print() и добавлять ещё один print(“ ”) с пробелом, чтобы отделять значения в строку.
// После вложенного цикла выводить пустой println() чтобы следующий проход начинать с новой строки. Результат должен быть как на картинке.



